I was able to run tf and apply the changes to the bucket without reimporting a resource. If I change behavior as requested by you it will apply what looks like a default config like so to every project

```
  # module.prod_project["whattrainisitnow"].google_logging_project_bucket_config.project will be created
  + resource "google_logging_project_bucket_config" "project" {
      + bucket_id        = "_Default"
      + description      = (known after apply)
      + enable_analytics = false
      + id               = (known after apply)
      + lifecycle_state  = (known after apply)
      + location         = "global"
      + name             = (known after apply)
      + project          = "moz-fx-whattrainisitnow-prod"
      + retention_days   = 30
    }
```

Is that what you mean?